/*======================================================================================================
		windowsの表示  [common.h]
																					Author:コ　笠
																					Date:2019/6/5
--------------------------------------------------------------------------------------------------------

======================================================================================================*/

#ifndef _COMMON_H_	// ２重インクルード防止のマクロ定義
#define _COMMON_H_

#define SCREEN_WIDTH (1280)     //スクリーン幅
#define SCREEN_HEIGHT (720)     //スクリーン高さ


enum SCENE {
	SCENE_NONE = 0,
	SCENE_TITLE,
	SCENE_GAME,
	SCENE_RESULT,
};

void SetScene(SCENE scene);
#endif
